const autobiography = `
來自馬來西亞來台灣求學，目前已在台灣將近五年了，希望能容納台灣文化。來台求學第一年，我就讀國立台灣師範大學僑先修班一年第一類組。在這一年當中，我一直都在思考到底要讀什麼系，畢竟每個同學都想讀熱門系如大眾傳播，媒體，設計等等。
在某一天，當我發現一部電影是描述facebook創始人的故事叫《社群網戰》激勵我，facebook創始人成為我的偶像。
這一部電影之後，我一直尋找深入了解facebook到底是什麼所造成現在巨大的人與人之間連接。在尋找我的好奇心中，我發現程式是什麼了。
網路上有許多的相當知名國外寫程式教程，我通過這些教程自學程式，自學程式讓我踏出第一步了。
由於我是第一類組，只有資訊管理是最接近有關程式開發的，我選擇東海選擇資管系。
在大學也是我另一個轉折點，在大一的時候，我充滿開心心情學習，可是不是我想像中那樣，在東海資管系讓我覺得偏向於商業的。雖然我一直都在自學程式，可是感覺缺乏一個平台。在大一下，我考慮要不要轉系到資訊工程組，畢竟我不是理工科出身，所以對於數理方面真的很差。
但是我對程式充滿了熱情，我願意付出，最終決定了轉系申請(如提交基本作品上去和自傳等)。
轉系成功了資訊工程-軟體工程組，雖然轉系成功但還要追回一定學分。我發現資工除了資訊理論外，總覺得缺乏實踐作品，我保持著自學程式，當然我會一直往最新科技和語言去學習。
在自學當中，我會做作品，一來可以了解自己能力，追求進步。
我最終發現自己想要什麼了，就是成為全端工程師  Full  Stack  Developer。
自學前端與後端等等，html,css,js,react,  nodejs,  mongodb,  expressjs,  meteor,  python,  flask...
雖然我還沒工作經驗，但我願意學習對於未來充滿好奇心和程式熱情。我一直對自己強調抱著學習態度，一個人可以什麼都沒有，但不能沒有態度，先做人後做事！
我希望能在貴公司給我機會和創造出公司未來價值。 
`

const selfIntro = `
Hello，大家好, 我是丘梓陽，來自馬來西亞，畢業於東海大學（資訊工程系），是一名前端工程師。
我熱愛追求技術來滿足使用者需求，希望可以更好提高使用者體驗。
我喜歡挑戰讓我人生更加精彩，目前專注於React，JavaScript設計模式。

`
const test = `將近年，前端技術迅速發展。
從還沒畢業前，就已經很明確目標，自訂職業規劃。
在我接觸產品使用，發現一個產品好與壞，除了功能滿足之外，最重要是用戶體驗（UX）。
我們可以看到前端技術迅速發展來改變我們使用體驗及開發者效率。`

export {autobiography, selfIntro};